PEAS‌‌ ربات فوتبالیست

عملکرد : گل زدن به تیم حریف و تلاش برای برد در مسابقات(کنترل توپ، دریبل ،دفاع،حمله،گل)و توجه ب قوانین برای خطا نکردن

معیار های موفقیت : تعداد پاس گل، تعداد پاس، تعداد برد،موقعیت نهایی در لیگ  دیگر بازیکن ها

محیط :
زمین های بازی فوتبال(سطح زمین میتواند از چمن مصنوعی یا طبیعی،آسفالت،مواد سخت یا شن یاشد)،
موانع(بازیکنان ،داوران،خط کشی های زمین)
شرایط(آب و هوا،نور،سروصدا)

سنسورها :
بینایی(موقعیت توپ و بازیکنان و دروازه ها و موانع)
شنوایی(صدای داور و مربی و سوت داور و هم تیمی ها و صدای تشویق)

حسگر فاصله :
  تشخص فاصله از توپ،دروازه،موانع و کمک برای حرکت صحیح و بدون نقض قوانین فوتبال مانند برخورد بد با بازیکن ها